![png](books_ERD.png)

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
# create connection
# connection = "dialect+driver://username:password@host:port/database"
connection = 'mysql+pymysql://root:PW@localhost/books'

In [3]:
# create engine
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/books)

In [6]:
# create database
create_database(connection)

In [7]:
# check db was made
database_exists(connection)

True

In [9]:
import pandas as pd
# make users df
users = pd.read_csv('Data/data-2.csv')
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [11]:
# add users df as a table in db
users.to_sql('users', engine, if_exists='replace')

In [12]:
# books df
books = pd.read_csv('Data/data-3.csv')
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [13]:
# authors df
authors = pd.read_csv('Data/data-4.csv')
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [14]:
# favorites df
favs = pd.read_csv('Data/data-5.csv')
favs.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [15]:
# add the dfs to the db as tables
books.to_sql('books', engine, if_exists='replace')
authors.to_sql('authors', engine, if_exists='replace')
favs.to_sql('favorites', engine, if_exists='replace')

In [16]:
q = '''
SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [19]:
# write a query at the end of your Jupyter Notebook to list the titles of all 
# of John Doe's favorite books.
q = '''
SELECT books.title
FROM books
JOIN favorites
ON books.id = favorites.book_id
WHERE favorites.user_id = (SELECT id
FROM users
WHERE first_name = 'John' AND last_name = 'Doe');'''
pd.read_sql(q, engine)

              title
0       The Shining
1                It
2  The Great Gatsby